# AnalyticalBusData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalBusData Class
Members See Also
---
Represents the data and parameters of analytical bus node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AnalyticalBusData : AnalyticalDistributionNodePropertyData
```

Visual Basic
---
```text
Public Class AnalyticalBusData _
	Inherits AnalyticalDistributionNodePropertyData
```

Visual C++
---
```text
public ref class AnalyticalBusData : public AnalyticalDistributionNodePropertyData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Electrical..::..AnalyticalDistributionNodePropertyData Autodesk.Revit.DB.Electrical..::..AnalyticalBusData
# See Also
AnalyticalBusData Members
Autodesk.Revit.DB.Electrical Namespace